run-SNOWPACKFoam/BYL-tundra-2014-2015-noHet-nodrift/0/Ti
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ti;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"../constant/transportProperties" 

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tref;

boundaryField
{
    top
    {
		
        //type            fixedGradient;
        //gradient           uniform -83;        		
           
        type            fixedValue;
        value           uniform $Tref;
        
        //type            zeroGradient;       
    }

    bottom
    {
		
        //type            fixedGradient;
        //gradient        uniform -83;       		
        
        type            fixedValue;
        value           uniform $Tref;
        
        //type            zeroGradient;       
    }

    left
    {
        type            cyclic;
        
        //type            fixedValue;
        //value           uniform 273.15;

        //type            zeroGradient;                                          
    }

    right
    {
        type            cyclic;
        
        //type            fixedValue;
        //value           uniform 243.15;
        
       //type            zeroGradient;                                                                        
    }

    frontAndBack
    {
        type empty;
    } 
}

// ************************************************************************* //

